app/controllers/plataforms_controller.rb

SELECT `plataforms`.* FROM `plataforms`
---
  def index
    @plataforms = Plataform.all

SELECT `plataforms`.* FROM `plataforms` WHERE `plataforms`.`id` = 1 LIMIT 1
---
  def show
    @plataform = Plataform.find(params[:id])

SELECT `plataforms`.* FROM `plataforms` WHERE `plataforms`.`id` = 1 LIMIT 1
---
  def edit
    @plataform = Plataform.find(params[:id])

INSERT INTO `plataforms` (`created_at`, `name`, `updated_at`) VALUES ('2013-02-15 19:24:46', 'PS3', '2013-02-15 19:24:46')
---
  def create
    @plataform = Plataform.new(params[:plataform])

    respond_to do |format|
      if @plataform.save